app/controllers/students_controller.rb

  def show
    student_id = params["id"].to_i
    @student = Student.find_by(student_id)
---
SELECT  "students".* FROM "students" WHERE (1) LIMIT 1